<h3>Author: KISHAN MISHRA<br><br>Roll: 19 <br><br> SIC : 190310106</h3>

In [3]:
import pandas as pd
import numpy as np

In [4]:
data = {
'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills',
'spoonbills'],
'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

In [5]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

<h3>1. Create a DataFrame birds from this dictionary data which has the index labels.</h3>

In [22]:
birds=pd.DataFrame(data,index=labels) 
birds.index.name='labels'
birds

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

<h3>2. Display a summary of the basic information about birds DataFrame and its data<h3>

In [23]:
birds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [24]:
birds.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

<h3>3.Print the first 2 rows of the birds dataframe<h3>

In [25]:
print(birds[:2])

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
b       Cranes  4.0       4      yes

In [26]:
birds.head(2)

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
b       Cranes  4.0       4      yes

<h3>4. Print all the rows with only 'birds' and 'age' columns from the dataframe</h3>

In [27]:
print(birds[["birds","age"]])

             birds  age
labels
a           Cranes  3.5
b           Cranes  4.0
c          plovers  1.5
d       spoonbills  NaN
e       spoonbills  6.0
f           Cranes  3.0
g          plovers  5.5
h           Cranes  NaN
i       spoonbills  8.0
j       spoonbills  4.0

<h3>5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']</h3>

In [28]:
birds[['birds', 'age', 'visits']].iloc[[2,3,7]]

             birds  age  visits
labels
c          plovers  1.5       3
d       spoonbills  NaN       4
h           Cranes  NaN       2

<h3>6. select the rows where the number of visits is less than 4<h3>

In [29]:
visit= birds[birds['visits'] < 4]
print(visit)

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

<h3>7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN<h3>

In [30]:
age_NaN = birds[birds['age'].isna()].filter(items=['birds', 'age'])
print(age_NaN)

             birds  age
labels
d       spoonbills  NaN
h           Cranes  NaN

<h3>8. Select the rows where the birds is a Cranes and the age is less than 4<h3>

In [32]:
birds[(birds['birds'] == 'Cranes') & (birds['age'] < 4)]

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
f       Cranes  3.0       4       no

<h3>9. Select the rows the age is between 2 and 4(inclusive)<h3>

In [33]:
birds[birds.age.between(2,4, inclusive=True)]

/var/folders/zd/x00f3z_d40zgsgh0nf_fpjmm0000gn/T/ipykernel_1915/3579895165.py:1: FutureWarning: Boolean inputs to the `inclusive` argument are deprecated infavour of `both` or `neither`.
  birds[birds.age.between(2,4, inclusive=True)]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
f           Cranes  3.0       4       no
j       spoonbills  4.0       2       no

<h3>10. Find the total number of visits of the bird Cranes<h3>

In [35]:
birds[birds['birds']=='Cranes']['visits'].sum()

12

<h3>11. Calculate the mean age for each different birds in dataframe.<h3>

In [37]:
birds[['birds','age']].groupby(['birds']).mean()

            age
birds
Cranes      3.5
plovers     3.5
spoonbills  6.0

<h3>12. Append a new row 'k' to dataframe with your choice of values for each column.Then delete that row to <br>return the original DataFrame.<h3>

In [38]:
new_row = pd.DataFrame({'birds':'Cranes', 'age':3.0, 'visits':2, 'priority': 'yes'}, index=['k'])
birds = birds.append(new_row)
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k      Cranes  3.0       2      yes

In [39]:
birds.drop(index='k', inplace=True)
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

<h3>13. Find the number of each type of birds in dataframe (Counts)<h3>

In [41]:
birds.groupby(['birds']).size()

birds
Cranes        4
plovers       2
spoonbills    4
dtype: int64

<h3>14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.<h3>

In [42]:
birds.sort_values(['age', 'visits'], ascending=[False, True], axis=0)

        birds  age  visits priority
i  spoonbills  8.0       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
j  spoonbills  4.0       2       no
b      Cranes  4.0       4      yes
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
h      Cranes  NaN       2      yes
d  spoonbills  NaN       4      yes

<h3>15. Replace the priority column values with'yes' should be 1 and 'no' should be 0 <h3>

In [44]:
birds_clone = birds.copy(deep=True)
birds_clone['priority'] = birds_clone.apply(lambda x: 1 if x['priority'] == 'yes' else 0 , axis=1)
birds_clone

        birds  age  visits  priority
a      Cranes  3.5       2         1
b      Cranes  4.0       4         1
c     plovers  1.5       3         0
d  spoonbills  NaN       4         1
e  spoonbills  6.0       3         0
f      Cranes  3.0       4         0
g     plovers  5.5       2         0
h      Cranes  NaN       2         1
i  spoonbills  8.0       3         0
j  spoonbills  4.0       2         0

<h3>16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.<h3>

In [46]:
birds_clone = birds.copy(deep=True)

birds_clone['birds'] = birds.apply(lambda x: 'trumpeters' if x['birds']=='Cranes' else x['birds'], axis=1)
birds_clone

        birds  age  visits priority
a  trumpeters  3.5       2      yes
b  trumpeters  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f  trumpeters  3.0       4       no
g     plovers  5.5       2       no
h  trumpeters  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no